SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_i2c.c
        /* Test if CLKCTRL value is under 0x1*/
        if ((speed_value & I2C_CLKCTRL_SET) < FM_CLKCTRL_LOW_LIMIT)
        {
            /* Set minimum allowed value */
            speed_value |= (uint16_t)FM_CLKCTRL_LOW_LIMIT;
        }
        /* Set speed value and set F/S bit for fast mode */
        temp_value |= (uint16_t)(speed_value | I2C_FSMODE_SET);
        
        /* Set Maximum Rise Time for fast mode */
        /* if APB1 frequency is 32MHz,period = 1/32*1000ns,so trise_value = period/TRISE+1=32*TRISE/1000+1,See the manual for details*/
        if(clk_speed <= CLK_SPEED_400K)   /* 100KHz~400KHz */ 
        {
            trise_value |= (((uint16_t)(((freq_value * (uint16_t)FM_TRISE_400K) / (uint16_t)1000) + (uint16_t)1)) & I2C_TMRISE_MASK);
        }
        else  /* 400KHz~1MHz */ 
        {
            trise_value |= (((uint16_t)(((freq_value * (uint16_t)FM_TRISE_1M) / (uint16_t)1000) + (uint16_t)1)) & I2C_TMRISE_MASK);
        }
    }
    /* Write to I2Cx TMRISE */
    I2Cx->TMRISE = trise_value;
    /* Write to I2Cx CLKCTRL */
    I2Cx->CLKCTRL = temp_value; 
    /* Enable the selected I2C peripheral */
    I2Cx->CTRL1 |= I2C_EN_SET;
}

/**
*\*\name    I2C_Bus_Mode_Config.
*\*\fun     Initializes the bus mode.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   mode
*\*\          - I2C_BUSMODE_I2C
*\*\          - I2C_BUSMODE_SMBDEVICE
*\*\          - I2C_BUSMODE_SMBHOST
*\*\return  none
**/
void I2C_Bus_Mode_Config(I2C_Module* I2Cx, uint16_t mode)
{
    uint16_t temp_value = 0;

    /* Get the I2Cx CTRL1 value */
    temp_value = I2Cx->CTRL1;
    /* Clear SMBTYPE and SMBUS bits */
    temp_value &= I2C_BUSMODE_CLR_MASK;
    /* Set SMBTYPE and SMBUS bits according to mode value */
    temp_value |= (uint16_t)((uint32_t)mode);
    /* Set I2Cx CTRL1 */
    I2Cx->CTRL1 = temp_value;
}

/**
*\*\name    I2C_Acknowledgement_Config.
*\*\fun     Initializes the acknowledgement.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   ack
*\*\          - I2C_ACKEN
*\*\          - I2C_ACKDIS
*\*\return  none
**/
void I2C_Acknowledgement_Config(I2C_Module* I2Cx, uint16_t ack)
{
    uint16_t temp_value = 0;

    /* Get the I2Cx CTRL1 value */
    temp_value = I2Cx->CTRL1;
    /* Clear ACKEN bits */
    temp_value &= I2C_ACKEN_CLR_MASK;
    /* Set ACKEN bits according to ack value */
    temp_value |= (uint16_t)((uint32_t)ack);
    /* Set I2Cx CTRL1 */
    I2Cx->CTRL1 = temp_value;
}

/**
*\*\name    I2C_Addressing_Mode_Config.
*\*\fun     Initializes addressing mode.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   mode
*\*\          - I2C_ADDR_MODE_7BIT
*\*\          - I2C_ADDR_MODE_10BIT
*\*\return  none
**/
void I2C_Addressing_Mode_Config(I2C_Module* I2Cx, uint16_t mode)
{
    uint16_t temp_value = 0;

    /* Get the I2Cx OADDR1 value */
    temp_value = I2Cx->OADDR1;
    /* Clear ADDRMODE bits */
    temp_value &= I2C_ADDRMODE_CLR_MASK;
    /* Set ACKEN bits according to mode value */
    temp_value |= mode;
    /* Set I2Cx OADDR1 */
    I2Cx->OADDR1 = temp_value;
}

/**
*\*\name    I2C_Own_Addr1_Config.
*\*\fun     Initializes the own address.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   addr1    between 0 to 0x3FF
*\*\return  none
**/
void I2C_Own_Addr1_Config(I2C_Module* I2Cx, uint16_t addr1)
{
    uint16_t temp_value = 0;

    /* Get the I2Cx OADDR1 value */
    temp_value = I2Cx->OADDR1;
    /* Clear ADDRMODE bits */
    temp_value &= I2C_OADDR_CLR_MASK;
    /* Set ACKEN bits according to mode value */
    temp_value |= addr1;
    /* Set I2Cx OADDR1 */
    I2Cx->OADDR1 = temp_value;

}

/**
*\*\name    I2C_Initializes_Structure.
*\*\fun     Fills each I2C_InitStruct member with its default value.
*\*\param   I2C_InitStruct :
*\*\          - ClkSpeed
*\*\          - BusMode
*\*\          - DutyCycle
*\*\          - OwnAddr1
*\*\          - AckEnable
*\*\          - AddrMode
*\*\return  none
**/
void I2C_Initializes_Structure(I2C_InitType* I2C_InitStruct)
{
    /*---------------- Reset I2C init structure parameters values ----------------*/
    /* initialize the ClkSpeed member */
    I2C_InitStruct->ClkSpeed = 5000;
    /* Initialize the BusMode member */
    I2C_InitStruct->BusMode = I2C_BUSMODE_I2C;
    /* Initialize the DutyCycle member */
    I2C_InitStruct->DutyCycle = I2C_FMDUTYCYCLE_2;
    /* Initialize the OwnAddr1 member */
    I2C_InitStruct->OwnAddr1 = 0;
    /* Initialize the AckEnable member */
    I2C_InitStruct->AckEnable = I2C_ACKDIS;
    /* Initialize the AddrMode member */
    I2C_InitStruct->AddrMode = I2C_ADDR_MODE_7BIT;
}

/**
*\*\name    I2C_ON.
*\*\fun     I2Cx turn ON.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_ON(I2C_Module* I2Cx)
{
    /* Enable the selected I2C peripheral */
    I2Cx->CTRL1 |= I2C_EN_SET;  
}

/**
*\*\name    I2C_OFF.
*\*\fun     I2Cx turn OFF.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_OFF(I2C_Module* I2Cx)
{
    /* Disable the selected I2C peripheral */
    I2Cx->CTRL1 &= I2C_EN_RESET;   
}

/**
*\*\name    I2C_DMA_Transfer_Enable.
*\*\fun     Enable I2C DMA transfer.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_DMA_Transfer_Enable(I2C_Module* I2Cx)
{
    /* Set the I2C_CTRL2 DMAEN bit to enable DMA transfer */
    I2Cx->CTRL2 |= I2C_DMAEN_SET;
}

/**
*\*\name    I2C_DMA_Transfer_Disable.
*\*\fun     Disable I2C DMA transfer.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_DMA_Transfer_Disable(I2C_Module* I2Cx)
{
    /* Clean the I2C_CTRL2 DMAEN bit to disable DMA transfer */
    I2Cx->CTRL2 &= I2C_DMAEN_RESET;
}

/**
*\*\name    I2C_DMA_Last_Transfer_Enable.
*\*\fun     Enable I2C DMA last transfer.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_DMA_Last_Transfer_Enable(I2C_Module* I2Cx)
{   
    /* Next DMA transfer is the last transfer */
    I2Cx->CTRL2 |= I2C_DMALAST_SET;
}

/**
*\*\name    I2C_DMA_Last_Transfer_Disable.
*\*\fun     Disable I2C DMA last transfer.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_DMA_Last_Transfer_Disable(I2C_Module* I2Cx)
{   
    /* Next DMA transfer is not the last transfer */
    I2Cx->CTRL2 &= I2C_DMALAST_RESET;
}

/**
*\*\name    I2C_Generate_Start_Enable.
*\*\fun     Enable Generate a START condition.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Generate_Start_Enable(I2C_Module* I2Cx)
{   
    /* Generate a START condition */
    I2Cx->CTRL1 |= I2C_START_SET;
}

/**
*\*\name    I2C_Generate_Start_Disable.
*\*\fun     Disable the START condition generation.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Generate_Start_Disable(I2C_Module* I2Cx)
{   
    /* Disable the START condition generation */
    I2Cx->CTRL1 &= I2C_START_RESET;
}

/**
*\*\name    I2C_Generate_Stop_Enable.
*\*\fun     Enable Generate a STOP condition.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Generate_Stop_Enable(I2C_Module* I2Cx)
{   
    /* Generate a STOP condition */
    I2Cx->CTRL1 |= I2C_STOP_SET;
}

/**
*\*\name    I2C_Generate_Stop_Disable.
*\*\fun     Disable the STOP condition generation.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Generate_Stop_Disable(I2C_Module* I2Cx)
{   
    /* Disable the STOP condition generation */
    I2Cx->CTRL1 &= I2C_STOP_RESET;
}

/**
*\*\name    I2C_Acknowledg_Enable.
*\*\fun     Enable the acknowledgement.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Acknowledg_Enable(I2C_Module* I2Cx)
{
   /* Enable the acknowledgement */
   I2Cx->CTRL1 |= I2C_ACK_SET;
}

/**
*\*\name    I2C_Acknowledg_Disable.
*\*\fun     Disable the acknowledgement.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Acknowledg_Disable(I2C_Module* I2Cx)
{
   /* Disable the acknowledgement */
   I2Cx->CTRL1 &= I2C_ACK_RESET;
}

/**
*\*\name    I2C_Own_Addr2_Set.
*\*\fun     Set the specified I2C own address2.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   address
*\*\          - 7bit I2C own address2
*\*\return  none
**/
void I2C_Own_Addr2_Set(I2C_Module* I2Cx, uint8_t address)
{
    uint16_t temp_value = 0;

    /* Get the old register value */
    temp_value = I2Cx->OADDR2;

    /* Reset I2Cx Own address2 bit [7:1] */
    temp_value &= I2C_ADDR2_RESET;

    /* Set I2Cx Own address2 */
    temp_value |= (uint16_t)((uint16_t)address & I2C_ADDR2_SET);

    /* Store the new register value */
    I2Cx->OADDR2 = temp_value;
}

/**
*\*\name    I2C_Dual_Addr_Enable.
*\*\fun     Enables the specified I2C dual addressing mode.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Dual_Addr_Enable(I2C_Module* I2Cx)
{
    /* Enable dual addressing mode */
    I2Cx->OADDR2 |= I2C_DUALEN_SET;
}

/**
*\*\name    I2C_Dual_Addr_Disable.
*\*\fun     Disable the specified I2C dual addressing mode.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Dual_Addr_Disable(I2C_Module* I2Cx)
{
    /* Disable dual addressing mode */
    I2Cx->OADDR2 &= I2C_DUALEN_RESET;
}

/**
*\*\name    I2C_General_Call_Enable.
*\*\fun     Enables the specified I2C general call feature.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_General_Call_Enable(I2C_Module* I2Cx)
{
    /* Enable generall call */
    I2Cx->CTRL1 |= I2C_GCEN_SET;
}

/**
*\*\name    I2C_General_Call_Disable.
*\*\fun     Disable the specified I2C general call feature.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_General_Call_Disable(I2C_Module* I2Cx)
{
    /* Disable generall call */
    I2Cx->CTRL1 &= I2C_GCEN_RESET;
}

/**
*\*\name    I2C_Interrupts_Enable.
*\*\fun     Enables the specified I2C interrupts.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   I2C_IT :
*\*\          - I2C_INT_BUF Buffer interrupt mask
*\*\          - I2C_INT_EVENT Event interrupt mask
*\*\          - I2C_INT_ERR Error interrupt mask
*\*\return  none
**/
void I2C_Interrupts_Enable(I2C_Module* I2Cx, uint16_t I2C_IT)
{
    /* Enable the selected I2C interrupts */
    I2Cx->CTRL2 |= I2C_IT;
}

/**
*\*\name    I2C_Interrupts_Disable.
*\*\fun     Disables the specified I2C interrupts.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   I2C_IT :
*\*\          - I2C_INT_BUF Buffer interrupt mask
*\*\          - I2C_INT_EVENT Event interrupt mask
*\*\          - I2C_INT_ERR Error interrupt mask
*\*\return  none
**/
void I2C_Interrupts_Disable(I2C_Module* I2Cx, uint16_t I2C_IT)
{
    /* Disable the selected I2C interrupts */
    I2Cx->CTRL2 &= (uint16_t)~I2C_IT;
}

/**
*\*\name    I2C_Data_Send.
*\*\fun     Sends a data byte through the I2Cx peripheral.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   data
*\*\return  none
**/
void I2C_Data_Send(I2C_Module* I2Cx, uint8_t data)
{
    /* Write in the DAT register the data to be sent */
    I2Cx->DAT = data;
}

/**
*\*\name    I2C_Data_Recv.
*\*\fun     Returns the most recent received data by the I2Cx peripheral.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  The value of the received data
**/
uint8_t I2C_Data_Recv(I2C_Module* I2Cx)
{
    /* Return the data in the DAT register */
    return (uint8_t)I2Cx->DAT;
}

/**
*\*\name    I2C_7bit_Addr_Send.
*\*\fun     Transmits the address byte to select the slave device.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   address
*\*\param   mode :
*\*\          - I2C_DIRECTION_SEND Transmitter mode
*\*\          - I2C_DIRECTION_RECV Receiver mode
*\*\return  none
**/
void I2C_7bit_Addr_Send(I2C_Module* I2Cx, uint8_t address, uint8_t mode)
{
    /* Test on the direction to set/reset the read/write bit */
    if (mode == I2C_DIRECTION_RECV)
    {
        /* Set the address bit0 for read */
        address |= I2C_ADDR0_SET;
    }
    else
    {
        /* Reset the address bit0 for write */
        address &= I2C_ADDR0_RESET;
    }
    /* Send the address */
    I2Cx->DAT = address;
}

/**
*\*\name    I2C_Register_Value_Get.
*\*\fun     Reads the specified I2C register and returns its value.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   I2C_Register :
*\*\          - I2C_REG_CTRL1 CTRL1 register
*\*\          - I2C_REG_CTRL2 CTRL2 register
*\*\          - I2C_REG_OADDR1 OADDR1 register
*\*\          - I2C_REG_OADDR2 OADDR2 register
*\*\          - I2C_REG_DAT DAT register
*\*\          - I2C_REG_STS1 STS1 register
*\*\          - I2C_REG_STS2 STS2 register
*\*\          - I2C_REG_CLKCTRL CLKCTRL register
*\*\          - I2C_REG_TMRISE TMRISE register
*\*\return  none
**/
uint16_t I2C_Register_Value_Get(I2C_Module* I2Cx, uint8_t I2C_Register)
{
    __IO uint32_t temp_value = 0;
    temp_value = (uint32_t)I2Cx;
    temp_value += I2C_Register;

    /* Return the selected register value */
    return (*(__IO uint16_t*)temp_value);
}

/**
*\*\name    I2C_Software_Reset_Enable.
*\*\fun     Enables the specified I2C software reset.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Software_Reset_Enable(I2C_Module* I2Cx)
{
    /* Peripheral under reset */
    I2Cx->CTRL1 |= I2C_SWRESET_SET;
}

/**
*\*\name    I2C_Software_Reset_Disable.
*\*\fun     Disables the specified I2C software reset.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Software_Reset_Disable(I2C_Module* I2Cx)
{
    /* Peripheral not under reset */
    I2Cx->CTRL1 &= I2C_SWRESET_RESET;
}

/**
*\*\name    I2C_NACK_Position_Set.
*\*\fun     Selects the specified I2C NACK position in master receiver mode.
*\*\        This function is useful in I2C Master Receiver mode when the number
*\*\        of data to be received is equal to 2. In this case, this function
*\*\        should be called (with parameter I2C_NACK_POS_NEXT) before data
*\*\        reception starts,as described in the 2-byte reception procedure
*\*\        recommended in Reference Manual in Section: Master receiver.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   position :
*\*\          - I2C_NACK_POS_NEXT Indicates that the next byte will be the last received byte.
*\*\          - I2C_NACK_POS_CURRENT Indicates that current byte is the last received byte.
*\*\note    This function configures the same bit (POS) as I2C_PEC_Position_Set()
*\*\        but is intended to be used in I2C mode while I2C_PEC_Position_Set()
*\*\        is intended to used in SMBUS mode.
*\*\return  none
**/
void I2C_NACK_Position_Set(I2C_Module* I2Cx, uint16_t position)
{
    if (position == I2C_NACK_POS_NEXT)
    {
        /* Next byte in shift register is the last received byte */
        I2Cx->CTRL1 |= I2C_NACK_POS_NEXT;
    }
    else
    {
        /* Current byte in shift register is the last received byte */
        I2Cx->CTRL1 &= I2C_NACK_POS_CURRENT;
    }
}

/**
*\*\name    I2C_SMBus_Alert_Pin_Set.
*\*\fun     Set the SMBus Alert pin high or low for the specified I2C.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   polarity :
*\*\          - I2C_SMBALERT_LOW SMBAlert pin driven low
*\*\          - I2C_SMBALERT_HIGH SMBAlert pin driven high
*\*\return  none
**/
void I2C_SMBus_Alert_Pin_Set(I2C_Module* I2Cx, uint16_t polarity)
{
    if (polarity == I2C_SMBALERT_LOW)
    {
        /* Drive the SMBusAlert pin Low */
        I2Cx->CTRL1 |= I2C_SMBALERT_LOW;
    }
    else
    {
        /* Drive the SMBusAlert pin High  */
        I2Cx->CTRL1 &= I2C_SMBALERT_HIGH;
    }
}

/**
*\*\name    I2C_PEC_Send_Enable.
*\*\fun     Enables the specified I2C PEC transfer.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_PEC_Send_Enable(I2C_Module* I2Cx)
{
    /* Enable the selected I2C PEC transmission */
    I2Cx->CTRL1 |= I2C_PEC_SET;
}

/**
*\*\name    I2C_PEC_Send_Disable.
*\*\fun     Disables the specified I2C PEC transfer.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_PEC_Send_Disable(I2C_Module* I2Cx)
{
    /* Disable the selected I2C PEC transmission */
    I2Cx->CTRL1 &= I2C_PEC_RESET;
}

/**
*\*\name    I2C_NACK_Position_Set.
*\*\fun     Selects the specified I2C PEC position.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   position :
*\*\          - I2C_PEC_POS_NEXT Indicates that the next byte is PEC
*\*\          - I2C_PEC_POS_CURRENT Indicates that current byte is PEC
*\*\note    This function configures the same bit (POS) as I2C_NACK_Position_Set()
*\*\        but is intended to be used in SMBUS mode while I2C_NACK_Position_Set()
*\*\        is intended to used in I2C mode.
*\*\return  none
**/
void I2C_PEC_Position_Set(I2C_Module* I2Cx, uint16_t position)
{
    if (position == I2C_PEC_POS_NEXT)
    {
        /* Next byte in shift register is PEC */
        I2Cx->CTRL1 |= I2C_PEC_POS_NEXT;
    }
    else
    {
        /* Current byte in shift register is PEC */
        I2Cx->CTRL1 &= I2C_PEC_POS_CURRENT;
    }
}

/**
*\*\name    I2C_PEC_Compute_Enable.
*\*\fun     Enables PEC value compute.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_PEC_Compute_Enable(I2C_Module* I2Cx)
{
    /* Enable the selected I2C PEC calculation */
    I2Cx->CTRL1 |= I2C_PECEN_SET;
}

/**
*\*\name    I2C_PEC_Compute_Disable.
*\*\fun     Disables PEC value compute.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_PEC_Compute_Disable(I2C_Module* I2Cx)
{
    /* Disable the selected I2C PEC calculation */
    I2Cx->CTRL1 &= I2C_PECEN_RESET;
}

/**
*\*\name    I2C_PEC_Get.
*\*\fun     Get the PEC value for the specified I2C.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  The PEC value
**/
uint8_t I2C_PEC_Get(I2C_Module* I2Cx)
{
    /* Return the selected I2C PEC value */
    return ((I2Cx->STS2) >> 8);
}

/**
*\*\name    I2C_ARP_Enable.
*\*\fun     Enables the specified I2C ARP.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_ARP_Enable(I2C_Module* I2Cx)
{
    /* Enable the selected I2C ARP */
    I2Cx->CTRL1 |= I2C_ARPEN_SET; 
}

/**
*\*\name    I2C_ARP_Disable.
*\*\fun     Disables the specified I2C ARP.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_ARP_Disable(I2C_Module* I2Cx)
{
    /* Disable the selected I2C ARP */
    I2Cx->CTRL1 &= I2C_ARPEN_RESET;
}

/**
*\*\name    I2C_Extend_Clock_Enable.
*\*\fun     Enables the specified I2C clock extending.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Extend_Clock_Enable(I2C_Module* I2Cx)
{
    /* Enable the selected I2C Clock extending */
    I2Cx->CTRL1 &= I2C_NOEXTEND_RESET; 
}

/**
*\*\name    I2C_Extend_Clock_Disable.
*\*\fun     Disables the specified I2C clock extending.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_Extend_Clock_Disable(I2C_Module* I2Cx)
{
    /* Disable the selected I2C Clock extending */
    I2Cx->CTRL1 |= I2C_NOEXTEND_SET;
}

/**
*\*\name    I2C_Fast_Mode_Duty_Cycle_Set.
*\*\fun     Set the specified I2C fast mode duty cycle.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   duty_cycle :
*\*\          - I2C_FMDUTYCYCLE_2 I2C fast mode Tlow/Thigh = 2
*\*\          - I2C_FMDUTYCYCLE_16_9 I2C fast mode Tlow/Thigh = 16/9
*\*\return  none
**/
void I2C_Fast_Mode_Duty_Cycle_Set(I2C_Module* I2Cx, uint16_t duty_cycle)
{
    if (duty_cycle == I2C_FMDUTYCYCLE_16_9)
    {
        /* I2C fast mode Tlow/Thigh=16/9 */
        I2Cx->CLKCTRL |= I2C_FMDUTYCYCLE_16_9;
        
