SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_i2c.c
    }
    else
    {
        /* I2C fast mode Tlow/Thigh=2 */
        I2Cx->CLKCTRL &= I2C_FMDUTYCYCLE_2;
    }
}

/**
*\*\name    I2C_Digital_Filter_Width_Set.
*\*\fun     SDA digital filter width selection.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   width :
*\*\          - 0x00 ~ 0x0F     The numbers of pclk cycles(width is 0x00: Disable the digital filter).
*\*\return  none
**/
void I2C_SDA_Digital_Filter_Width_Set(I2C_Module* I2Cx, uint8_t width)
{
    uint32_t temp_value = 0;

    temp_value = I2Cx->TMRISE;
    /* Clear SDADFW[3:0] bits */
    temp_value &= I2C_SDADFW_MASK;
    /* Set SDADFW[3:0] bits according to width value */
    temp_value |= ((uint32_t)width << RCC_TMRISE_SDADFW_OFFSET);
    /* Store the new value */
    I2Cx->TMRISE = temp_value;
    
}

/**
*\*\name    I2C_SCL_Digital_Filter_Width_Set.
*\*\fun     SCL digital filter width selection.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   width :
*\*\          - 0x00            Disable the digital filter.
*\*\          - 0x01 ~ 0x0F     The numbers of pclk cycles.
*\*\return  none
**/
void I2C_SCL_Digital_Filter_Width_Set(I2C_Module* I2Cx, uint8_t width)
{
    uint32_t temp_value = 0;

    temp_value = I2Cx->TMRISE;
    /* Clear SCLDFW[3:0] bits */
    temp_value &= I2C_SCLDFW_MASK;
    /* Set SCLDFW[3:0] bits according to width value */
    temp_value |= ((uint32_t)width << RCC_TMRISE_SCLDFW_OFFSET);
    /* Store the new value */
    I2Cx->TMRISE = temp_value;
    
}

/**
*\*\name    I2C_SDA_Analog_Filter_Width_Set.
*\*\fun     SDA analog filter width selection.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   width :
*\*\        - I2C_ANALOG_FILTER_WIDTH_5NS   
*\*\        - I2C_ANALOG_FILTER_WIDTH_15NS  
*\*\        - I2C_ANALOG_FILTER_WIDTH_25NS  
*\*\        - I2C_ANALOG_FILTER_WIDTH_35NS  
*\*\return  none
**/
void I2C_SDA_Analog_Filter_Width_Set(I2C_Module* I2Cx, uint32_t width)
{
    uint32_t temp_value = 0;

    temp_value = I2Cx->TMRISE;
    /* Clear SDAAFW[1:0] bits */
    temp_value &= I2C_SDAAFW_MASK;
    /* Set SDAAFW[1:0] bits according to width value */
    temp_value |= width;
    /* Store the new value */
    I2Cx->TMRISE = temp_value;
    
}

/**
*\*\name    I2C_SDA_Analog_Filter_Enable.
*\*\fun     Enables the SDA analog filter.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_SDA_Analog_Filter_Enable(I2C_Module* I2Cx)
{
    /* Enable the SDA analog filter */
    I2Cx->TMRISE |= I2C_SDAAFENN_SET;
}

/**
*\*\name    I2C_SDA_Analog_Filter_Disable.
*\*\fun     Disables the SDA analog filter.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_SDA_Analog_Filter_Disable(I2C_Module* I2Cx)
{
    /* Disable the SDA analog filter */
    I2Cx->TMRISE &= I2C_SDAAFENN_RESET;
}

/**
*\*\name    I2C_SCL_Analog_Filter_Width_Set.
*\*\fun     SCL analog filter width selection.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   width :
*\*\        - I2C_ANALOG_FILTER_WIDTH_5NS   
*\*\        - I2C_ANALOG_FILTER_WIDTH_15NS  
*\*\        - I2C_ANALOG_FILTER_WIDTH_25NS  
*\*\        - I2C_ANALOG_FILTER_WIDTH_35NS  
*\*\return  none
**/
void I2C_SCL_Analog_Filter_Width_Set(I2C_Module* I2Cx, uint32_t width)
{
    uint32_t temp_value = 0;

    temp_value = I2Cx->TMRISE;
    /* Clear SCLAFW[1:0] bits */
    temp_value &= I2C_SCLAFW_MASK;
    /* Set SCLAFW[1:0] bits according to width value */
    temp_value |= (width << RCC_SDAAFW_SCLAFW_OFFSET);
    /* Store the new value */
    I2Cx->TMRISE = temp_value;
    
}

/**
*\*\name    I2C_SCL_Analog_Filter_Enable.
*\*\fun     Enables the SCL analog filter.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_SCL_Analog_Filter_Enable(I2C_Module* I2Cx)
{
    /* Enable the SCL analog filter */
    I2Cx->TMRISE |= I2C_SCLAFENN_SET;
}

/**
*\*\name    I2C_SCL_Analog_Filter_Disable.
*\*\fun     Disables the SCL analog filter.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\return  none
**/
void I2C_SCL_Analog_Filter_Disable(I2C_Module* I2Cx)
{
    /* Disable the SCL analog filter */
    I2Cx->TMRISE &= I2C_SCLAFENN_RESET;
}

/**
*\*\brief I2C State Monitoring Functions
*\*\      This I2C driver provides three different ways for I2C state monitoring
*\*\      depending on the application requirements and constraints:
*\*\
*\*\
*\*\ 1) Basic state monitoring:
*\*\    Using I2C_Event_Check() function:
*\*\    It compares the status registers (STS1 and STS2) content to a given event
*\*\    (can be the combination of one or more flags).
*\*\    It returns SUCCESS if the current status includes the given flags
*\*\    and returns ERROR if one or more flags are missing in the current status.
*\*\    - When to use:
*\*\      - This function is suitable for most applications as well as for startup
*\*\      activity since the events are fully described in the product reference manual.
*\*\      - It is also suitable for users who need to define their own events.
*\*\    - Limitations:
*\*\      - If an error occurs (ie. error flags are set besides to the monitored flags),
*\*\        the I2C_Event_Check() function may return SUCCESS despite the communication
*\*\        hold or corrupted real state.
*\*\        In this case, it is advised to use error interrupts to monitor the error
*\*\        events and handle them in the interrupt IRQ handler.
*\*\
*\*\note
*\*\        For error management, it is advised to use the following functions:
*\*\          - I2C_ConfigInt() to configure and enable the error interrupts (I2C_INT_ERR).
*\*\          - I2Cx_ER_IRQHandler() which is called when the error interrupt occurs.
*\*\            Where x is the peripheral instance (I2C1, I2C2 ...)
*\*\          - I2C_Flag_Status_Get() or I2C_GetIntStatus() to be called into I2Cx_ER_IRQHandler()
*\*\            in order to determine which error occured.
*\*\          - I2C_Flag_Status_Clear() or I2C_ClrIntPendingBit() and/or I2C_EnableSoftwareReset()
*\*\            and/or I2C_Generate_Stop_Enable() in order to clear the error flag and source,
*\*\            and return to correct communication status.
*\*\
*\*\
*\*\  2) Advanced state monitoring:
*\*\     Using the function I2C_Last_Event_Get() which returns the image of both status
*\*\     registers in a single word (uint32_t) (Status Register 2 value is shifted left
*\*\     by 16 bits and concatenated to Status Register 1).
*\*\     - When to use:
*\*\       - This function is suitable for the same applications above but it allows to
*\*\         overcome the mentioned limitation of I2C_Flag_Status_Get() function.
*\*\         The returned value could be compared to events already defined in the
*\*\         library (n32g430_i2c.h) or to custom values defined by user.
*\*\       - This function is suitable when multiple flags are monitored at the same time.
*\*\       - At the opposite of I2C_Event_Check() function, this function allows user to
*\*\         choose when an event is accepted (when all events flags are set and no
*\*\         other flags are set or just when the needed flags are set like
*\*\         I2C_Event_Check() function).
*\*\     - Limitations:
*\*\       - User may need to define his own events.
*\*\       - Same remark concerning the error management is applicable for this
*\*\         function if user decides to check only regular communication flags (and
*\*\         ignores error flags).
*\*\
*\*\
*\*\  3) Flag-based state monitoring:
*\*\     Using the function I2C_Flag_Status_Get() which simply returns the status of
*\*\     one single flag (ie. I2C_FLAG_RXDATNE ...).
*\*\     - When to use:
*\*\        - This function could be used for specific applications or in debug phase.
*\*\        - It is suitable when only one flag checking is needed (most I2C events
*\*\          are monitored through multiple flags).
*\*\     - Limitations:
*\*\        - When calling this function, the Status register is accessed. Some flags are
*\*\          cleared when the status register is accessed. So checking the status
*\*\          of one Flag, may clear other ones.
*\*\        - Function may need to be called twice or more in order to monitor one
*\*\          single event.
*\*\
*\*\  For detailed description of Events, please refer to section I2C_Events in
*\*\  n32g430_i2c.h file.
*\*\
**/


/**
*\*\name    I2C_Event_Check.
*\*\fun     Checks whether the last I2Cx Event is equal to the one passed as parameter.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   I2C_event :
*\*\          - I2C_EVT_SLAVE_SEND_ADDR_MATCHED                 EV1
*\*\          - I2C_EVT_SLAVE_RECV_ADDR_MATCHED                 EV1
*\*\          - I2C_EVT_SLAVE_SEND_ADDR2_MATCHED                EV1
*\*\          - I2C_EVT_SLAVE_RECV_ADDR2_MATCHED                EV1
*\*\          - I2C_EVT_SLAVE_GCALLADDR_MATCHED                 EV1
*\*\          - I2C_EVT_SLAVE_DATA_RECVD                        EV2
*\*\          - (I2C_EVT_SLAVE_DATA_RECVD | I2C_FLAG_DUALFLAG)  EV2
*\*\          - (I2C_EVT_SLAVE_DATA_RECVD | I2C_FLAG_GCALLADDR) EV2
*\*\          - I2C_EVT_SLAVE_DATA_SENDED                       EV3
*\*\          - (I2C_EVT_SLAVE_DATA_SENDED | I2C_FLAG_DUALFLAG) EV3
*\*\          - (I2C_EVT_SLAVE_DATA_SENDED | I2C_FLAG_GCALLADDR)EV3
*\*\          - I2C_EVT_SLAVE_ACK_MISS                          EV3_2
*\*\          - I2C_EVT_SLAVE_STOP_RECVD                        EV4
*\*\          - I2C_EVT_MASTER_MODE_FLAG                        EV5
*\*\          - I2C_EVT_MASTER_TXMODE_FLAG                      EV6
*\*\          - I2C_EVT_MASTER_RXMODE_FLAG                      EV6
*\*\          - I2C_EVT_MASTER_DATA_RECVD_FLAG                  EV7
*\*\          - I2C_EVT_MASTER_DATA_SENDING                     EV8
*\*\          - I2C_EVT_MASTER_DATA_SENDED                      EV8_2
*\*\          - I2C_EVT_MASTER_MODE_ADDRESS10_FLAG              EV9
*\*\note    For detailed description of Events, please refer to section
*\*\        I2C_Events in n32g430_i2c.h file.
*\*\return  SUCCESS or ERROR
**/
ErrorStatus I2C_Event_Check(I2C_Module* I2Cx, uint32_t I2C_event)
{
    uint32_t le_value = 0;
    uint32_t flag1 = 0, flag2 = 0;

